'use client';

import React from 'react';
import styled from 'styled-components';

const Privacy = () => {
	return (
		<Wrapper>
			<h3>
				개인정보처리방침 가정통신문은(는) 개인정보보호법에 따라 이용자의 개인정보 보호 및 권익을 보호하고 개인정보와
				관련한 이용자의 고충을 원활하게 처리할 수 있도록 다음과 같은 처리방침을 두고 있습니다. 가정통신문은(는)
				개인정보처리방침을 개정하는 경우 웹사이트 공지사항(또는 개별공지)을 통하여 공지할 것입니다.
			</h3>
			<p>
				<strong>1. 개인정보의 수집 및 이용 목적, 수집하는 개인정보의 항목 및 수집방법</strong> 가정통신문은(는)
				개인정보를 다음의 목적을 위해 처리합니다. 처리한 개인정보는 다음의 목적 이외의 용도로는 사용되지 않으며 이용
				목적이 변경될 시에는 사전동의를 구할 예정입니다.
			</p>
			<ol>
				<li>
					홈페이지 회원가입 및 관리 회원 가입의사 확인, 회원자격 유지·관리, 서비스 부정이용 방지, 만14세 미만 아동
					개인정보 수집 시 법정대리인 동의 여부 확인, 각종 고지·통지, 고충처리, 분쟁 조정을 위한 기록 보존 등을 목적으로
					개인정보를 처리합니다.
				</li>
				<li>
					재화 또는 서비스 제공, 청구서 발송, 콘텐츠 제공, 본인인증, 연령인증, 요금결제·정산 등을 목적으로 개인정보를
					처리합니다.
				</li>
				<li>
					마케팅 및 광고 신규 서비스 개발 및 맞춤 서비스 제공, 이벤트 및 광고성 정보 제공 및 참여기회 제공, 인구통계학적
					특성에 따른 서비스 제공 및 광고 게재, 서비스의 유효성 확인, 접속빈도 파악 또는 회원의 서비스 이용에 대한 통계
					등을 목적으로 개인정보를 처리합니다.
				</li>
			</ol>
			<p>가정통신문은(는) 위에 명시한 목적을 위해 다음과 같은 개인정보를 수집하고 있습니다.</p>
			<ol>
				<li>필수항목: 이름, 이메일</li>
				<li>수집방법: 홈페이지</li>
			</ol>
			<p>
				서비스 이용과정이나 사업 처리 과정에서 서비스 이용기록, 접속 로그, 쿠키, 접속 IP정보, 기기정보, 결제기록,
				이용정지 기록과 같은 정보들이 생성되어 수집 가능
			</p>
			<p>
				<strong>2. 개인정보의 처리 및 보유 기간</strong>
			</p>
			<ol>
				<li>
					가정통신문은(는) 법령에 따른 개인정보 보유·이용기간 또는 정보주체로부터 개인정보를 수집시에 동의 받은 개인정보
					보유,이용기간 내에서 개인정보를 처리,보유합니다.
				</li>
				<li>
					회사는 회원의 탈퇴에도 불구하고 관련 법령에서 의무보유기간에 대해 별도로 정한 경우에는 해당 기간 종료 시까지
					개인정보를 보유합니다.
				</li>
			</ol>
			<p>각각의 개인정보 처리 및 보유 기간은 다음과 같습니다.</p>
			<ol>
				<li>계약 또는 청약철회 등에 관한 기록: 5년(전자상거래 등에서의 소비자보호에 관한 법률)</li>
				<li>대금결제, 재화 등의 공급에 관한 기록: 5년(전자상거래 등에서의 소비자보호에 관한 법률)</li>
				<li>소비자의 불만 또는 분쟁처리에 관한 기록: 3년(전자상거래 등에서의 소비자보호에 관한 법률)</li>
				<li>전자금융 거래에 관한 기록: 5년(전자금융거래법)</li>
				<li>사이트 방문에 관한 기록, 로그인 기록: 3개월(통신비밀보호법)</li>
			</ol>
			<p>
				<strong>정보주체와 법정대리인의 권리·의무 및 그 행사방법</strong>
				이용자는 개인정보 주체로서 다음과 같은 권리를 행사할 수 있습니다.
			</p>
			<ol>
				<li>
					회원 및 법정대리인(회원이 만 14세 미만 아동인 경우)은 법령에 저촉되지 아니하는 범위 내에서 자신 또는 만 14세
					미만 아동의 개인정보에 대한 열람, 정정, 삭제, 처리정지를 요청할 수 있습니다. 회사는 법령이 정한 바에 따라
					본인확인 기타 사실확인을 위한 정보 또는 자료의 제공을 요청할 수 있습니다.
				</li>
				<li>
					제1항에 따른 권리 행사는 가정통신문에 대해 개인정보 보호법 시행령 제41조제1항에 따라 서면, 전자우편 등을
					통하여 하실 수 있으며 가정통신문은 이에 대해 지체 없이 조치하겠습니다.
				</li>
				<li>
					제1항에 따른 권리 행사는 정보주체의 법정대리인이나 위임을 받은 자 등 대리인을 통하여 하실 수 있습니다. 이 경우
					개인정보 보호법 시행규칙 별지 제11호 서식에 따른 위임장을 제출하셔야 합니다.
				</li>
				<li>
					개인정보 열람 및 처리정지 요구는 개인정보보호법 제35조 제5항, 제37조 제2항에 의하여 정보주체의 권리가 제한 될
					수 있습니다.
				</li>
				<li>
					개인정보의 정정 및 삭제 요구는 다른 법령에서 그 개인정보가 수집 대상으로 명시되어 있는 경우에는 그 삭제를
					요구할 수 없습니다.
				</li>
				<li>
					가정통신문은 정보주체 권리에 따른 열람의 요구, 정정·삭제의 요구, 처리정지의 요구 시 열람 등 요구를 한 자가
					본인이거나 정당한 대리인인지를 확인합니다.
				</li>
			</ol>
			<p>
				<strong>개인정보 자동 수집 장치의 설치/운영 및 거부에 관한 사항</strong>
			</p>
			<p>
				가정통신문은(는) 회원의 정보를 수시로 저장하고 불러오는 쿠키(cookie)를 사용합니다. 쿠키는 웹사이트 이용 시
				서버가 사용자의 웹브라우저에 보내는 작은 데이터 꾸러미로 회원의 컴퓨터의 하드디스크에 저장됩니다. 가정통신문은
				다음과 같은 목적을 위해 쿠키를 사용합니다.
			</p>
			<h2>사용목적</h2>
			<ol>
				<li>이용자의 접속 유지</li>
				<li>
					이용자의 접속 빈도나 방문 시간 등을 분석, 이용자의 취향과 관심분야를 파악 및 자취 추적, 각종 이벤트 참여 정도
					및 방문 횟수 파악 등을 통한 타겟 마케팅 및 개인 맞춤 서비스 제공
				</li>
			</ol>
			<p>
				이용자는 쿠키 설치에 대한 선택권을 가지고 있으며 웹브라우저에서 옵션을 설정함으로써 모든 쿠키를 허용하거나,
				쿠키가 저장될 때마다 확인을 거치거나, 아니면 모든 쿠키의 저장을 거부할 수 있습니다.
			</p>
			<h2>개인정보의 파기 등</h2>
			<ol>
				<li>
					“가정통신문”은 개인정보 보유기간의 경과, 처리목적 달성 등 개인정보가 불필요하게 되었을 때에는 해당 개인정보를
					복구·재생할 수 없도록 지체 없이 파기합니다.
				</li>
				<li>
					전항에도 불구하고 이용자로부터 계속 보관·이용에 관한 별도 동의를 받거나 관련 법령에 따라 개인정보를 계속
					보유하여야 하는 경우에는, 해당 개인정보를 해당 목적 범위 내에서 안전하게 보관·이용합니다.
				</li>
				<li>
					개인정보 파기의 절차 및 방법은 다음과 같습니다.
					<ol>
						<li>
							파기절차: 회사는 파기 사유가 발생한 개인정보를 선정하고, 회사의 개인정보 보호책임자의 승인을 받아
							개인정보를 파기합니다.
						</li>
						<li>
							파기방법: 회사는 전자적 파일 형태로 기록․ 저장된 개인정보는 기록을 재생할 수 없도록 파기하며, 종이 문서에
							기록․저장된 개인정보는 분쇄기로 분쇄하거나 소각하여 파기합니다.
						</li>
					</ol>
				</li>
			</ol>
			<h2>개인정보 관리</h2>
			<p>
				개인정보침해에 관한 상담이 필요한 경우에는 한국정보보호진흥원, 대검찰청 인터넷범죄수사센터, 경찰청
				사이버테러대응센터 등으로 문의하실 수 있습니다.
			</p>
			<ul>
				<li>
					개인정보침해신고센터 (<a href="http://privacy.kisa.or.kr">privacy.kisa.or.kr</a> / 국번없이 118)
				</li>
				<li>
					개인정보분쟁조정위원회 (<a href="http://www.kopico.go.kr">www.kopico.go.kr</a> / 1833-6972)
				</li>
				<li>
					대검찰청 사이버수사과 (<a href="http://www.spo.go.kr">www.spo.go.kr</a> / 국번없이 1301)
				</li>
				<li>
					경찰청 사이버안전국 (<a href="http://cyberbureau.police.go.kr">cyberbureau.police.go.kr</a> / 국번없이 182)
				</li>
			</ul>
			<h2>고지의 의무</h2>
			<p>
				현재 개인정보 취급 방침에서 내용의 추가, 삭제 및 수정이 있을 시에는 변경사항의 시행일의 7일 전부터 공지됩니다.
			</p>
			<p>본 방침은 2024년 03월 17일부터 시행됩니다.</p>
		</Wrapper>
	);
};

export default Privacy;

const Wrapper = styled.div`
	width: 92%;
	padding: 2rem;
`;
